Revit 2027 API
ParameterTypeId.LeaderSnapReference Property
 "Leader Snap Reference"
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId LeaderSnapReference { get; }
Public Shared ReadOnly Property LeaderSnapReference As ForgeTypeId
	Get
public:
static property ForgeTypeId^ LeaderSnapReference {
	ForgeTypeId^ get ();
}
static member LeaderSnapReference : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace